##### What is the difference between join() and merge() in Pandas?
##### What is the difference(s) between merge() and concat() in Pandas?

In [15]:
import pandas as pd
import numpy as np

In [16]:
a = pd.Series([10, 20, 30, 40])
b = pd.Series([10, 20, 30, 40])

df = pd.DataFrame(a, columns=['a'])
df['b'] = b
df.insert(2,'c',[2,4,5,8], True)
df1 = df.assign(d=[3,5,9,2])
address = {'Delhi': 10, 'Bangalore': 20,
           'Patna': 30, 'Chennai': 40}
df1['e'] = address
df1

    a   b  c  d   e
0  10  10  2  3 NaN
1  20  20  4  5 NaN
2  30  30  5  9 NaN
3  40  40  8  2 NaN

In [17]:
data = {'Name': ['Ankit', 'Amit',
				'Aishwarya', 'Priyanka'],
		'Age': [21, 19, 20, 18],
		'Stream': ['Math', 'Commerce',
				'Arts', 'Biology'],
		'Percentage': [88, 92, 95, 70]}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age',
								'Stream', 'Percentage'])
print('Printthe DataFrame: ')
display(df)
print('Iterate DataFrame over Rows: ')
for k, v in df.iterrows():
    print(v)
    break

Printthe DataFrame:

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

Iterate DataFrame over Rows:
Name          Ankit
Age              21
Stream         Math
Percentage       88
Name: 0, dtype: object

In [18]:
# Drop the Rows
df.drop([1,2], inplace = True)

df

       Name  Age   Stream  Percentage
0     Ankit   21     Math          88
3  Priyanka   18  Biology          70

In [19]:
# Drop the Columns
df.drop(['Age', 'Stream'], axis = 1, inplace = True)
df

       Name  Percentage
0     Ankit          88
3  Priyanka          70

##### Add New Rows

In [20]:
df.loc[len(df.index)] = ['Hk', 75]
# df_1 = {'Name': 'RR', 'Percentage': 78}
# df = df.append(df_1, ignore_index = True)

dict = {'Name':['Amy', 'Maddy'],
        'Percentage':[79, 82]
        }
df2 = pd.DataFrame(dict)
df3 = pd.concat([df, df2], ignore_index = True)
df3

       Name  Percentage
0     Ankit          88
1  Priyanka          70
2        Hk          75
3       Amy          79
4     Maddy          82

##### Drop a row and a column in pandas DataFrame

In [30]:
df3.drop([3], inplace=True)
# Delete a column in Pandas DataFrame
# df3.drop(["Percentage"], axis = 1, inplace = True)
print(df3)

       Name  Percentage
0     Ankit          88
1  Priyanka          70
2        Hk          75
4     Maddy          82

In [6]:
for ind in df.index:
	print(df['Name'][ind], df['Percentage'][ind])
# iterate through each row and select
# 'Name' and 'Age' column respectively using loc

# for i in range(len(df)):
#     print(df.loc[i, "Name"], df.loc[i, "Percentage"])

Ankit 88
Priyanka 70

In [11]:
df = pd.DataFrame(
	[[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
	[10, 11, 12]],
	columns=['a', 'b', 'c'])
display(df)
# convert dataframe to numpy array
arr = df.to_numpy()

print('\nNumpy Array\n----------\n', arr)
print(type(arr))

print('Display DataFrame Again: ')
df_arr = pd.DataFrame(arr)
df_arr

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

Numpy Array
----------
 [[ 1  2  3]
 [ 4  5  6]
 [ 7  8  9]
 [10 11 12]]
<class 'numpy.ndarray'>
Display DataFrame Again:

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [15]:
# Convert Pandas Series into DataFrame
s = pd.Series(['C', 'C++', 'Java', 'Python', 'Perl', 'Ruby', 'Julia'])
df_series = s.to_frame().reset_index()
df_series

   index       0
0      0       C
1      1     C++
2      2    Java
3      3  Python
4      4    Perl
5      5    Ruby
6      6   Julia

In [16]:
# Renaming our index column as 'new_index'
df_series.rename(columns = {'index':'new_index'}, inplace = True)

df_series

   new_index       0
0          0       C
1          1     C++
2          2    Java
3          3  Python
4          4    Perl
5          5    Ruby
6          6   Julia

In [18]:
numbers = {'mynumbers': [51, 52, 53, 54, 55]}
df = pd.DataFrame(numbers, columns =['mynumbers'])

df['<= 53'] = df['mynumbers'].apply(lambda x: True if x <= 53 else False)

print (df)

   mynumbers  <= 53
0         51   True
1         52   True
2         53   True
3         54  False
4         55  False

In [19]:
names = {'First_name': ['Hanah', 'Ria', 'Jay', 'Bholu', 'Sachin']}
df = pd.DataFrame(names)
df

  First_name
0      Hanah
1        Ria
2        Jay
3      Bholu
4     Sachin

In [2]:
record = {
'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya' ],
'Age': [21, 19, 20, 18, 17, 21],
'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
'Percentage': [88, 92, 95, 70, 65, 78]}

labels = ['a', 'b', 'c', 'd', 'e', 'f']

# create a dataframe
dataframe = pd.DataFrame(record, index = labels, columns = ['Name', 'Age', 'Stream', 'Percentage'])
options = ['Math', 'Science']

# selecting rows based on condition
rslt_df = dataframe[(dataframe['Age'] == 21) & dataframe['Stream'].isin(options)]

# Same result we can get by loc
# rslt_df = dataframe.loc[(dataframe['Age'] == 21) & dataframe['Stream'].isin(options)]

print('\nResult dataframe :\n', rslt_df)

Result dataframe :
       Name  Age   Stream  Percentage
a    Ankit   21     Math          88
f  Shaurya   21  Science          78

4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [3]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df = df.iloc[:3]
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [4]:
df = df[['name', 'score']]
df

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5

6. Write a Pandas program to select the specified columns and rows from a given data frame.
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [5]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

print(df.iloc[[1, 3, 5, 6], [1, 3]])

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [6]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

print('total_rows', len(df.axes[0]))
print('total_cols', len(df.axes[1]))
print()

new_df = df[df['attempts']>2]
print(new_df)

total_rows 10
total_cols 4

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [7]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

print(df[df['score'].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [8]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

print(df.loc[(df['score'] >= 15) & (df['score']<= 20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [9]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

print(df.loc[(df['attempts'] > 2) & (df['score']< 15)])

   name  score  attempts qualify
b  Dima    9.0         3      no

*** 12. Write a Pandas program to change the score in row 'd' to 11.5.

In [10]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

print("\nChange the score in row 'd' to 11.5:\n")
df.loc['d', 'score'] = 11.5
print(df)

Change the score in row 'd' to 11.5:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [11]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)

sum_attempts = sum(df.attempts.to_list())
print(sum_attempts)
print(df['attempts'].sum())
print(df['score'].mean())

19
19
13.5625

15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame. 
Values for each column will be:
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"

In [12]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)
df.loc['k'] = [1, 'Suresh', 'yes', 15.5]

print(df)
print("\nDelete the new row and display the original  rows:")
df = df.drop('k')
print(df)

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima     9.0        3      no
c  Katherine    16.5        2     yes
d      James     NaN        3      no
e      Emily     9.0        2      no
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
j      Jonas    19.0        1     yes
k          1  Suresh      yes    15.5

Delete the new row and display the original  rows:
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

###### 50. Write a Pandas program to sort a given DataFrame by two or more columns.

In [13]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

df = df.sort_values(by=['name', 'score'], ascending=[False, True])

df

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [14]:
df['qualify'] = df['qualify'].map({'yes':True, 'no':False})
df

        name  score  attempts  qualify
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
c  Katherine   16.5         2     True
j      Jonas   19.0         1     True
d      James    NaN         3    False
e      Emily    9.0         2    False
b       Dima    9.0         3    False
a  Anastasia   12.5         1     True

18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [15]:
df['name'] = df['name'].replace('James', 'Suresh')
df

        name  score  attempts  qualify
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
c  Katherine   16.5         2     True
j      Jonas   19.0         1     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
b       Dima    9.0         3    False
a  Anastasia   12.5         1     True

20. Write a Pandas program to insert a new column in existing DataFrame.

In [16]:
df['new_col'] = [2,3,4,7,2,6,3,8,4,2]
df

        name  score  attempts  qualify  new_col
f    Michael   20.0         3     True        2
g    Matthew   14.5         1     True        3
h      Laura    NaN         1    False        4
i      Kevin    8.0         2    False        7
c  Katherine   16.5         2     True        2
j      Jonas   19.0         1     True        6
d     Suresh    NaN         3    False        3
e      Emily    9.0         2    False        8
b       Dima    9.0         3    False        4
a  Anastasia   12.5         1     True        2

21. Write a Pandas program to iterate over rows in a DataFrame.

In [17]:
exam_data = [
    {'name':'Anastasia', 'score':12.5},
    {'name':'Dima','score':9},
    {'name':'Katherine','score':16.5}
]
df = pd.DataFrame(exam_data)

for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

22. Write a Pandas program to get list from DataFrame column headers.

In [18]:
print(list(df.columns))
print(list(df.columns.values))

['name', 'score']
['name', 'score']

<!-- 23. Write a Pandas program to rename columns of a given DataFrame
https://www.geeksforgeeks.org/how-to-rename-columns-in-pandas-dataframe/ -->

23. Write a Pandas program to rename columns of a given DataFrame : 
https://www.geeksforgeeks.org/how-to-rename-columns-in-pandas-dataframe/

25. Write a Pandas program to change the order of a DataFrame columns.

In [19]:
df = df[['score', 'name']]
df

   score       name
0   12.5  Anastasia
1    9.0       Dima
2   16.5  Katherine

26. Write a Pandas program to add one row in an existing DataFrame. : https://www.geeksforgeeks.org/how-to-add-one-row-in-an-existing-pandas-dataframe/

In [20]:
df.loc[len(df.index)] = [17, 'k']
df.loc[len(df.index)] = [17, 'kk']
df

   score       name
0   12.5  Anastasia
1    9.0       Dima
2   16.5  Katherine
3   17.0          k
4   17.0         kk

*** 28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [21]:
data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']
}
df = pd.DataFrame(data)

count_df = df.groupby(["city"]).size().reset_index(name='Number of people')
display(count_df)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

29. Write a Pandas program to delete DataFrame row(s) based on given column value.

In [22]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
new_df = df[df.col2 != 5]
new_df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

31. Write a Pandas program to select a row of series/dataframe by given integer index.

In [23]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
new_df = df.iloc[[2]]
new_df

   col1  col2  col3
2     3     6     9

*** 33. Write a Pandas program to convert index in a column of the given dataframe.

In [24]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
df = pd.DataFrame(exam_data)
print("\nAfter converting index in a column:")
df.reset_index(level=0, inplace=True)
print(df)
print("\nHiding index:")
print( df.to_string(index=False))

After converting index in a column:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Hiding index:
 index      name  score  attempts qualify
     0 Anastasia   12.5         1     yes
     1      Dima    9.0         3      no
     2 Katherine   16.5         2     yes
     3     James    NaN         3      no
     4     Emily    9.0         2      no
     5   Michael   20.0         3     yes
     6   Matthew   14.5         1     yes
     7     Laura    NaN         1      no
     8     Kevin    8.0         2      no
     9     Jonas   19.0         1     yes

34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value.
Change score value of 8 to 10.2

In [25]:
df.at[8, 'score'] =  10.2
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin   10.2         2      no
9      9      Jonas   19.0         1     yes

*** 36. Write a Pandas program to drop a list of rows from a specified DataFrame.

In [26]:
df = df.drop(df.index[[2,4]])
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
3      3      James    NaN         3      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin   10.2         2      no
9      9      Jonas   19.0         1     yes

*** 38. Write a Pandas program to divide a DataFrame in a given ratio.
70% & 30% of the said DataFrame

###### 67. Write a Pandas program to split a given DataFrame into two random subsets.

In [27]:
df = pd.DataFrame(np.random.randn(10, 2))

part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)

print("\n70% of the said DataFrame:")
display(part_70)
print("\n30% of the said DataFrame:")
display(part_30)

70% of the said DataFrame:

          0         1
8  1.577514 -0.385012
2 -0.856739 -0.767665
5 -0.348015  0.354004
6 -0.716731  0.373443
3  0.792748 -0.348324
1  0.532060 -0.277045
0 -0.141964 -0.689976

30% of the said DataFrame:

          0         1
4 -0.454819 -0.215455
7 -1.141283 -2.264413
9  1.176024  0.216781

39. Write a Pandas program to combining two series into a DataFrame.

In [28]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['10', '20', 'php', '30.12', '40'])

df = pd.concat([s1, s2], axis=1)
print("New DataFrame combining two series:")
display(df)

New DataFrame combining two series:

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

45. Write a Pandas program to find the row for where the value of a given column is maximum.

In [29]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Row where col1 has maximum value: ", df['col1'].argmax())
print("Row where col2 has maximum value: ", df['col2'].argmax())
print("Row where col3 has maximum value: ", df['col3'].argmax())

Row where col1 has maximum value:  4
Row where col2 has maximum value:  3
Row where col3 has maximum value:  2

51. Write a Pandas program to convert the datatype of a given column (floats to ints).

In [30]:
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9.1, 16.5, 12.77, 9.21, 20.22, 14.5, 11.34, 8.8, 19.13],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
df = pd.DataFrame(exam_data)

print("\nNow change the Data type of 'score' column from float to int:")
df.score = df.score.astype(int)
display(df)
print("\nData types of the columns of the DataFrame now:")
print(df.dtypes)

Now change the Data type of 'score' column from float to int:

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James     12         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura     11         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes

Data types of the columns of the DataFrame now:
name        object
score        int64
attempts     int64
qualify     object
dtype: object

*** 52. Write a Pandas program to remove infinite values from a given DataFrame. : https://www.geeksforgeeks.org/remove-infinite-values-from-a-given-pandas-dataframe/

In [31]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print("Removing infinite values:")
df = df.replace([np.inf, -np.inf], np.nan)
display(df)

Removing infinite values:

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

*** 53. Write a Pandas program to insert a given column at a specific column index in a DataFrame. : https://www.geeksforgeeks.org/insert-a-given-column-at-a-specific-position-in-a-pandas-dataframe/

In [32]:
 d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
new_col = [1, 2, 3, 4, 7]  
# insert the said column at the beginning in the DataFrame
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
print("\nNew DataFrame")
display(df)

New DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

54. Write a Pandas program to convert a given list of lists into a Dataframe. : 
Original list of lists: [[2, 4], [1, 3]]

In [33]:
data = [[2, 4], [1, 3]]
df = pd.DataFrame(data, columns=['col1', 'col2'])
display(df)


my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
# sets the headers as list
headers = my_lists.pop(0) 

df1 = pd.DataFrame(my_lists, columns = headers)
print("New DataFrame")
display(df1)

   col1  col2
0     2     4
1     1     3

New DataFrame

   col1  col2
0     2     4
1     1     3

55. Write a Pandas program to group by the first column and get second column as lists in rows.

In [34]:
df = pd.DataFrame({
    'col1':['C1','C1','C2','C2','C2','C3','C2'],
    'col2':[1,2,3,3,4,6,5]
})
df = df.groupby('col1')['col2'].apply(list)
print("\nGroup on the col1:")
display(df)

Group on the col1:

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

56. Write a Pandas program to get column index from column name of a given DataFrame.

In [35]:
d = {
    'col1': [1, 2, 3, 4, 7], 
    'col2': [4, 5, 6, 9, 5],
    'col3': [7, 8, 12, 1, 11]
}
df = pd.DataFrame(data=d)
print("\nIndex of 'col2'")
print(df.columns.get_loc("col2"))

Index of 'col2'
1

58. Write a Pandas program to select all columns, except one given column in a DataFrame.

In [36]:
print("\nAll columns except 'col3':")
df = df.loc[:, df.columns != 'col3']
display(df)

All columns except 'col3':

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

60. Write a Pandas program to get last n records of a DataFrame.

In [37]:
display(df.iloc[:3, :])
display(df.head(3))

   col1  col2
0     1     4
1     2     5
2     3     6

   col1  col2
0     1     4
1     2     5
2     3     6

*** 61. Write a Pandas program to get topmost n records within each group of a DataFrame.

In [38]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("\ntopmost n records within each group of a DataFrame:")
df1 = df.nlargest(3, 'col1')
print(df1)
df2 = df.nlargest(3, 'col2')
print(df2)
df3 = df.nlargest(3, 'col3')
print(df3)

topmost n records within each group of a DataFrame:
   col1  col2  col3
5    11     0    11
4     7     5     1
3     4     9    12
   col1  col2  col3
3     4     9    12
2     3     6     8
1     2     5     5
   col1  col2  col3
3     4     9    12
5    11     0    11
2     3     6     8

64. Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [39]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("\nAdd prefix:")
print(df.add_prefix("A_"))
print("\nAdd suffix:")
print(df.add_suffix("_1"))

Add prefix:
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

Add suffix:
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

*** 65. Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [40]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print("\nReverse column order:")
display(df.loc[:, ::-1])
print("\nReverse row order:")
display(df.loc[::-1])
print("\nReverse row order and reset index:")
display(df.loc[::-1].reset_index(drop = True))

Reverse column order:

    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

Reverse row order:

    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86

Reverse row order and reset index:

    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

66. Write a Pandas program to select columns by data type of a given DataFrame.

In [41]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("\nSelect numerical columns")
display(df.select_dtypes(include = "number"))
print("\nSelect string columns")
display(df.select_dtypes(include = "object"))

Select numerical columns

    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0

Select string columns

             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

*** 69. Write a Pandas program to merge datasets and check uniqueness.

In [42]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})

df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print("\nNew DataFrames:")
display(df)
display(df1)
print('\n"one_to_one”: check if merge keys are unique in both left and right datasets:"')
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
display(df_one_to_one)
print('\n"one_to_many” or “1:m”: check if merge keys are unique in left dataset:')
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
display(df_one_to_many)
print('“many_to_one” or “m:1”: check if merge keys are unique in right dataset:')
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
display(df_many_to_one)

New DataFrames:

           Name Date_Of_Birth    Age
2   Ryan Parkes     25/09/1998  22.5
3  Eesha Hinton     11/05/2002  22.0
4  Syed Wharton     15/09/1997  23.0

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

"one_to_one”: check if merge keys are unique in both left and right datasets:"

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

"one_to_many” or “1:m”: check if merge keys are unique in left dataset:

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

“many_to_one” or “m:1”: check if merge keys are unique in right dataset:

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

*** 70. Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical. 
Name: age_groups, dtype: category ; Categories (3, object): [kids < adult < elderly]
https://www.geeksforgeeks.org/pandas-cut-continuous-to-categorical/

In [43]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
display(df["age_groups"])

Age group:

0       kids
1      adult
2    elderly
3      adult
4    elderly
5       kids
Name: age_groups, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

72. Write a Pandas program to combine many given series to create a DataFrame.

In [44]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print("Combine above series to a dataframe:")
ser_df = pd.DataFrame(sr1, sr2).reset_index()
display(ser_df.head())
print("\nUsing pandas concat:")
ser_df = pd.concat([sr1, sr2], axis = 1)
display(ser_df.head())
print("\nUsing pandas DataFrame with a dictionary, gives a specific name to the columns:")
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
display(ser_df.head(5))

Combine above series to a dataframe:

   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN

Using pandas concat:

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

Using pandas DataFrame with a dictionary, gives a specific name to the columns:

     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

73. Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [45]:
print("DataFrame: Contains random values:")
df1 = pd.util.testing.makeDataFrame() # contains random values
display(df1.head(2))
print("\nDataFrame: Contains missing values:")
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
display(df2.head(2))
print("\nDataFrame: Contains datetime values:")
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
display(df3.head(2))
print("\nDataFrame: Contains mixed values:")
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
display(df4.head(2))

DataFrame: Contains random values:

/home/heptagon/anaconda3/envs/chatgpt/lib/python3.9/site-packages/pandas/util/__init__.py:16: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
8yw3I2WjmU -0.634671  1.657072  0.414235  1.679806
qfVKiRhlee  0.451577  0.084083 -1.138418  0.913458

DataFrame: Contains missing values:

                   A         B         C         D
bPsfmg0GTV  2.432182 -0.456568  0.282440 -1.336465
wqxJLGrd7q  0.592583  0.655928  1.150708 -0.032040

DataFrame: Contains datetime values:

                   A         B         C         D
2000-01-03 -0.968140 -0.159116 -0.119580 -1.055731
2000-01-04  0.583856  0.826734  0.983613  0.973829

DataFrame: Contains mixed values:

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02

*** 75. Write a Pandas program to use a local variable within a query.

In [46]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
maxx = df["W"].max()
print("\nValues which are less than maximum value of 'W' column")
display(df.query("W < @maxx"))

Values which are less than maximum value of 'W' column

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

*** 76. Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [47]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print("\nData Types:")
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print("\nNew Data Types:")
display(df["purchase"].apply(type))            
display(df)

Data Types:
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

New Data Types:

0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

*** 78. Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [48]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})

df1['rnum']=df1.rnum.where(df1.rnum.eq(df1.rnum.cummax()),0)
print("\nReplace current value in a dataframe column based on last largest value:")
display(df1.head())

Replace current value in a dataframe column based on last largest value:

   rnum
0    23
1     0
2    27
3     0
4    34

80. Write a Pandas program to check for inequality of two given DataFrames.

In [49]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});

print("\nCheck for inequality of the said dataframes:")
display(df1.ne(df2))

Check for inequality of the said dataframes:

       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

*** 81. Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [50]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)

print("\nLowest n records within each group of a DataFrame:")
df1 = df.nsmallest(3, 'col1')
display(df1)
df2 = df.nsmallest(3, 'col2')
display(df2)
df3 = df.nsmallest(3, 'col3')
display(df3)

Lowest n records within each group of a DataFrame:

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5

   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7